HELP = """
    *📚 Доступные разделы портфолио :*

    👤 /about - О себе

    🎯 /goal - Моя цель

    💻 /itstory - Как я пришел в IT

    👩‍🏫 /mentor - Мой ментор

    📈 /progress - Точка А → Точка Б

    🎮 /hobby - Хобби и интересы

    🏆 /works - Мои лучшие работы

    🔗 /github - Мой GitHub

    ℹ️ Также вы можете использовать кнопки в меню для удобной навигации.
    """



ABOUT  = """
    *👤 О себе :*

    Меня зовут Райиан, мне 13 лет.

    Я начинающий Python-разработчик и ученик школы программирования CAP Education.

    Я увлекаюсь программированием, играми и IT технологиями.

    Факты обо мне :
    • Интересуюсь IT и исскусственным интеллектом.
    • Развиваю навыки программирования через проекты и обучение.
    • Люблю решать логические задачи.
    """



GOAL = """
    *🎯 Моя цель :*
    
    Стать проффессиональным Python-разработчиком и работать в IT сфере.

    Я хочу научится создавать полезные приложения, сайты и учавствовать в проектах.

    Моя главная цель - превратить программирование в профессию.
    """



ITSTORY = """
    *💻 Как я пришел в IT :*

    Сначала я начал изучать информатику в школе.

    Со временем эта сфера меня сильно заинтересовала и даже восхитила.

    Именно тогда я пеонял, что хочу развиваться в IT.
    """



MENTOR = """
    *👩‍🏫 Мой ментор :*

    Мой ментор - опытная женщина-преподаватель, которая сопровождает меня в изучении програмирования.

    Она помогает мне понимать сложные темы, обьсняет основы разработки и поддерживает мой рост в IT.

    Благодаря ей я научился писать более чистый код и уверенне работать над проектами.
    """



PROGRESS = """
    *📈 Мой прогресс :*

    Точка А:
    • Не умел писать код
    • Не знал Python

    Точка Б:
    • Создаю Telegram-ботов
    • Пишу простые проекты на Python
    • Работаю с библиотеками и GitHub
    """



HOBBY = """
    *🎮 Хобби и интересы :*

    • Программирование
    • Компьютерные игры
    • Просмотр фильмов и сериалов
    • Прогулки с друзьями
    """



WORK1 = """
    🏆 *Проект №1 - Бот-конвертер валют :*

    Я разработал Telegram-бота для конвертации валют. Пользовател может быстро перевести одну валюту в другую и получить актуальный результат.
    Оссобеностью проекта является поддержка двух языков интерфейса - русского и английского. Пользователь может выбрать удобный язык и пользоваться ботом без ограничений.
    Во время работы над проектом я научился обрабатывать команды, создавать удобный интерфейс для пользователей и работать с данными о валютах.

    Ниже представлены скриншоты проекта 👇
    """



WORK2 = """
    🏆 *Проект №2 - Бот-напоминалка о воде :*

    Я разработал Telegram-бота помогает пользователям соблюдать водный баланс и не забывать пить воду в течение дня.
    Бот отправляет напоминание через определённые промежутки времени и мотивирует пользователя поддерживать полезную привычку.
    В ходе создания проекта я научился работать с Telegram Bot API, обрабатывать команды пользователя и создавать полезные инструменты на Python.

    Ниже представлены скриншоты проекта 👇
    """



GITHUB = """
    🔗 *Вот ссылка на мой GitHub :*

    https://github.com/Rayan-nn

    Там вы можете найти этот проект.
    """



